Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Infineon/XMC1400_series/Include/XMC1401.h
/** Macro to clear a bit in register */
#define CLR_BIT(reg, pos)     (reg = reg & (uint32_t)(~((uint32_t)1<<pos)) )
/*
* ==========================================================================
* ---------- Interrupt Handler Definition ----------------------------------
* ==========================================================================
*/
#define IRQ_Hdlr_0   IRQ0_Handler
#define IRQ_Hdlr_1   IRQ1_Handler
#define IRQ_Hdlr_2   IRQ2_Handler
#define IRQ_Hdlr_3   IRQ3_Handler
#define IRQ_Hdlr_4   IRQ4_Handler
#define IRQ_Hdlr_5   IRQ5_Handler
#define IRQ_Hdlr_6   IRQ6_Handler
#define IRQ_Hdlr_7   IRQ7_Handler
#define IRQ_Hdlr_8   IRQ8_Handler
#define IRQ_Hdlr_9   IRQ9_Handler
#define IRQ_Hdlr_10  IRQ10_Handler
#define IRQ_Hdlr_11  IRQ11_Handler
#define IRQ_Hdlr_12  IRQ12_Handler
#define IRQ_Hdlr_13  IRQ13_Handler
#define IRQ_Hdlr_14  IRQ14_Handler
#define IRQ_Hdlr_15  IRQ15_Handler
#define IRQ_Hdlr_16  IRQ16_Handler
#define IRQ_Hdlr_17  IRQ17_Handler
#define IRQ_Hdlr_18  IRQ18_Handler
#define IRQ_Hdlr_19  IRQ19_Handler
#define IRQ_Hdlr_20  IRQ20_Handler
#define IRQ_Hdlr_21  IRQ21_Handler
#define IRQ_Hdlr_22  IRQ22_Handler
#define IRQ_Hdlr_23  IRQ23_Handler
#define IRQ_Hdlr_24  IRQ24_Handler
#define IRQ_Hdlr_25  IRQ25_Handler
#define IRQ_Hdlr_26  IRQ26_Handler
#define IRQ_Hdlr_27  IRQ27_Handler
#define IRQ_Hdlr_28  IRQ28_Handler
#define IRQ_Hdlr_29  IRQ29_Handler
#define IRQ_Hdlr_30  IRQ30_Handler
#define IRQ_Hdlr_31  IRQ31_Handler

/*
* ==========================================================================
* ---------- Interrupt Handler retrieval macro -----------------------------
* ==========================================================================
*/
#define GET_IRQ_HANDLER(N) IRQ_Hdlr_##N


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif


typedef struct {
  __IO uint32_t  MOFCR;                             /*!< (@ 0x50041000) Message Object Function Control Register               */
  __IO uint32_t  MOFGPR;                            /*!< (@ 0x50041004) Message Object FIFO/Gateway Pointer Register           */
  __IO uint32_t  MOIPR;                             /*!< (@ 0x50041008) Message Object Interrupt Pointer Register              */
  __IO uint32_t  MOAMR;                             /*!< (@ 0x5004100C) Message Object Acceptance Mask Register                */
  __IO uint32_t  MODATAL;                           /*!< (@ 0x50041010) Message Object Data Register Low                       */
  __IO uint32_t  MODATAH;                           /*!< (@ 0x50041014) Message Object Data Register High                      */
  __IO uint32_t  MOAR;                              /*!< (@ 0x50041018) Message Object Arbitration Register                    */
  
  union {
    __I  uint32_t  MOSTAT;                          /*!< (@ 0x5004101C) Message Object Status Register                         */
    __O  uint32_t  MOCTR;                           /*!< (@ 0x5004101C) Message Object Control Register                        */
  };
} CAN_MO_TypeDef;                                      /*!< (@ 0x50041020) Cluster End. Size = 32 (0x20)                          */


/* ================================================================================ */
/* ================                       PPB                      ================ */
/* ================================================================================ */


/**
  * @brief Cortex-M0 Private Peripheral Block (PPB)
  */

typedef struct {                                    /*!< (@ 0xE000E000) PPB Structure                                          */
  __I  uint32_t  RESERVED[4];
  __IO uint32_t  SYST_CSR;                          /*!< (@ 0xE000E010) SysTick Control and Status Register                    */
  __IO uint32_t  SYST_RVR;                          /*!< (@ 0xE000E014) SysTick Reload Value Register                          */
  __IO uint32_t  SYST_CVR;                          /*!< (@ 0xE000E018) SysTick Current Value Register                         */
  __I  uint32_t  SYST_CALIB;                        /*!< (@ 0xE000E01C) SysTick Calibration Value Register                     */
  __I  uint32_t  RESERVED1[56];
  __IO uint32_t  NVIC_ISER;                         /*!< (@ 0xE000E100) Interrupt Set-enable Register                          */
  __I  uint32_t  RESERVED2[31];
  __IO uint32_t  NVIC_ICER;                         /*!< (@ 0xE000E180) IInterrupt Clear-enable Register                       */
  __I  uint32_t  RESERVED3[31];
  __IO uint32_t  NVIC_ISPR;                         /*!< (@ 0xE000E200) Interrupt Set-pending Register                         */
  __I  uint32_t  RESERVED4[31];
  __IO uint32_t  NVIC_ICPR;                         /*!< (@ 0xE000E280) Interrupt Clear-pending Register                       */
  __I  uint32_t  RESERVED5[95];
  __IO uint32_t  NVIC_IPR0;                         /*!< (@ 0xE000E400) Interrupt Priority Register 0                          */
  __IO uint32_t  NVIC_IPR1;                         /*!< (@ 0xE000E404) Interrupt Priority Register 1                          */
  __IO uint32_t  NVIC_IPR2;                         /*!< (@ 0xE000E408) Interrupt Priority Register 2                          */
  __IO uint32_t  NVIC_IPR3;                         /*!< (@ 0xE000E40C) Interrupt Priority Register 3                          */
  __IO uint32_t  NVIC_IPR4;                         /*!< (@ 0xE000E410) Interrupt Priority Register 4                          */
  __IO uint32_t  NVIC_IPR5;                         /*!< (@ 0xE000E414) Interrupt Priority Register 5                          */
  __IO uint32_t  NVIC_IPR6;                         /*!< (@ 0xE000E418) Interrupt Priority Register 6                          */
  __IO uint32_t  NVIC_IPR7;                         /*!< (@ 0xE000E41C) Interrupt Priority Register 7                          */
  __I  uint32_t  RESERVED6[568];
  __I  uint32_t  CPUID;                             /*!< (@ 0xE000ED00) CPUID Base Register                                    */
  __IO uint32_t  ICSR;                              /*!< (@ 0xE000ED04) Interrupt Control and State Register                   */
  __I  uint32_t  RESERVED7;
  __IO uint32_t  AIRCR;                             /*!< (@ 0xE000ED0C) Application Interrupt and Reset Control Register       */
  __IO uint32_t  SCR;                               /*!< (@ 0xE000ED10) System Control Register                                */
  __I  uint32_t  CCR;                               /*!< (@ 0xE000ED14) Configuration and Control Register                     */
  __I  uint32_t  RESERVED8;
  __IO uint32_t  SHPR2;                             /*!< (@ 0xE000ED1C) System Handler Priority Register 2                     */
  __IO uint32_t  SHPR3;                             /*!< (@ 0xE000ED20) System Handler Priority Register 3                     */
  __IO uint32_t  SHCSR;                             /*!< (@ 0xE000ED24) System Handler Control and State Register              */
} PPB_Type;


/* ================================================================================ */
/* ================                   ERU [ERU0]                   ================ */
/* ================================================================================ */


/**
  * @brief Event Request Unit 0 (ERU)
  */

typedef struct {                                    /*!< (@ 0x40010600) ERU Structure                                          */
  __IO uint32_t  EXISEL;                            /*!< (@ 0x40010600) Event Input Select                                     */
  __I  uint32_t  RESERVED[3];
  __IO uint32_t  EXICON[4];                         /*!< (@ 0x40010610) Event Input Control                                    */
  __IO uint32_t  EXOCON[4];                         /*!< (@ 0x40010620) Event Output Trigger Control                           */
} ERU_GLOBAL_TypeDef;


/* ================================================================================ */
/* ================                      MATH                      ================ */
/* ================================================================================ */


/**
  * @brief MATH Unit (MATH)
  */

typedef struct {                                    /*!< (@ 0x40030000) MATH Structure                                         */
  __I  uint32_t  RESERVED;
  __IO uint32_t  GLBCON;                            /*!< (@ 0x40030004) Global Control Register                                */
  __I  uint32_t  ID;                                /*!< (@ 0x40030008) Module Identification Register                         */
  __IO uint32_t  EVIER;                             /*!< (@ 0x4003000C) Event Interrupt Enable Register                        */
  __I  uint32_t  EVFR;                              /*!< (@ 0x40030010) Event Flag Register                                    */
  __O  uint32_t  EVFSR;                             /*!< (@ 0x40030014) Event Flag Set Register                                */
  __O  uint32_t  EVFCR;                             /*!< (@ 0x40030018) Event Flag Clear Register                              */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  DVD;                               /*!< (@ 0x40030020) Dividend Register                                      */
  __IO uint32_t  DVS;                               /*!< (@ 0x40030024) Divisor Register                                       */
  __I  uint32_t  QUOT;                              /*!< (@ 0x40030028) Quotient Register                                      */
  __I  uint32_t  RMD;                               /*!< (@ 0x4003002C) Remainder Register                                     */
  __I  uint32_t  DIVST;                             /*!< (@ 0x40030030) Divider Status Register                                */
  __IO uint32_t  DIVCON;                            /*!< (@ 0x40030034) Divider Control Register                               */
  __I  uint32_t  RESERVED2[2];
  __IO uint32_t  STATC;                             /*!< (@ 0x40030040) CORDIC Status and Data Control Register                */
  __IO uint32_t  CON;                               /*!< (@ 0x40030044) CORDIC Control Register                                */
  __IO uint32_t  CORDX;                             /*!< (@ 0x40030048) CORDIC X Data Register                                 */
  __IO uint32_t  CORDY;                             /*!< (@ 0x4003004C) CORDIC Y Data Register                                 */
  __IO uint32_t  CORDZ;                             /*!< (@ 0x40030050) CORDIC Z Data Register                                 */
  __I  uint32_t  CORRX;                             /*!< (@ 0x40030054) CORDIC X Result Register                               */
  __I  uint32_t  CORRY;                             /*!< (@ 0x40030058) CORDIC Y Result Register                               */
  __I  uint32_t  CORRZ;                             /*!< (@ 0x4003005C) CORDIC Z Result Register                               */
} MATH_Type;


/* ================================================================================ */
/* ================                       PAU                      ================ */
/* ================================================================================ */


/**
  * @brief PAU Unit (PAU)
  */

typedef struct {                                    /*!< (@ 0x40000000) PAU Structure                                          */
  __I  uint32_t  RESERVED[16];
  __I  uint32_t  AVAIL0;                            /*!< (@ 0x40000040) Peripheral Availability Register 0                     */
  __I  uint32_t  AVAIL1;                            /*!< (@ 0x40000044) Peripheral Availability Register 1                     */
  __I  uint32_t  AVAIL2;                            /*!< (@ 0x40000048) Peripheral Availability Register 2                     */
  __I  uint32_t  RESERVED1[13];
  __IO uint32_t  PRIVDIS0;                          /*!< (@ 0x40000080) Peripheral Privilege Access Register 0                 */
  __IO uint32_t  PRIVDIS1;                          /*!< (@ 0x40000084) Peripheral Privilege Access Register 1                 */
  __IO uint32_t  PRIVDIS2;                          /*!< (@ 0x40000088) Peripheral Privilege Access Register 2                 */
  __I  uint32_t  RESERVED2[221];
  __I  uint32_t  ROMSIZE;                           /*!< (@ 0x40000400) ROM Size Register                                      */
  __I  uint32_t  FLSIZE;                            /*!< (@ 0x40000404) Flash Size Register                                    */
  __I  uint32_t  RESERVED3[2];
  __I  uint32_t  RAM0SIZE;                          /*!< (@ 0x40000410) RAM0 Size Register                                     */
} PAU_Type;


/* ================================================================================ */
/* ================                       NVM                      ================ */
/* ================================================================================ */


/**
  * @brief NVM Unit (NVM)
  */

