Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Infineon/XMC1400_series/Include/XMC1401.h
/* --------------------------------  PAU_PRIVDIS0  -------------------------------- */
#define PAU_PRIVDIS0_PDIS2_Pos                (2UL)                     /*!< PAU PRIVDIS0: PDIS2 (Bit 2)                                 */
#define PAU_PRIVDIS0_PDIS2_Msk                (0x4UL)                   /*!< PAU PRIVDIS0: PDIS2 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS0_PDIS5_Pos                (5UL)                     /*!< PAU PRIVDIS0: PDIS5 (Bit 5)                                 */
#define PAU_PRIVDIS0_PDIS5_Msk                (0x20UL)                  /*!< PAU PRIVDIS0: PDIS5 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS0_PDIS6_Pos                (6UL)                     /*!< PAU PRIVDIS0: PDIS6 (Bit 6)                                 */
#define PAU_PRIVDIS0_PDIS6_Msk                (0x40UL)                  /*!< PAU PRIVDIS0: PDIS6 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS0_PDIS7_Pos                (7UL)                     /*!< PAU PRIVDIS0: PDIS7 (Bit 7)                                 */
#define PAU_PRIVDIS0_PDIS7_Msk                (0x80UL)                  /*!< PAU PRIVDIS0: PDIS7 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS0_PDIS19_Pos               (19UL)                    /*!< PAU PRIVDIS0: PDIS19 (Bit 19)                               */
#define PAU_PRIVDIS0_PDIS19_Msk               (0x80000UL)               /*!< PAU PRIVDIS0: PDIS19 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS0_PDIS20_Pos               (20UL)                    /*!< PAU PRIVDIS0: PDIS20 (Bit 20)                               */
#define PAU_PRIVDIS0_PDIS20_Msk               (0x100000UL)              /*!< PAU PRIVDIS0: PDIS20 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS0_PDIS21_Pos               (21UL)                    /*!< PAU PRIVDIS0: PDIS21 (Bit 21)                               */
#define PAU_PRIVDIS0_PDIS21_Msk               (0x200000UL)              /*!< PAU PRIVDIS0: PDIS21 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS0_PDIS22_Pos               (22UL)                    /*!< PAU PRIVDIS0: PDIS22 (Bit 22)                               */
#define PAU_PRIVDIS0_PDIS22_Msk               (0x400000UL)              /*!< PAU PRIVDIS0: PDIS22 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS0_PDIS23_Pos               (23UL)                    /*!< PAU PRIVDIS0: PDIS23 (Bit 23)                               */
#define PAU_PRIVDIS0_PDIS23_Msk               (0x800000UL)              /*!< PAU PRIVDIS0: PDIS23 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS0_PDIS24_Pos               (24UL)                    /*!< PAU PRIVDIS0: PDIS24 (Bit 24)                               */
#define PAU_PRIVDIS0_PDIS24_Msk               (0x1000000UL)             /*!< PAU PRIVDIS0: PDIS24 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS0_PDIS25_Pos               (25UL)                    /*!< PAU PRIVDIS0: PDIS25 (Bit 25)                               */
#define PAU_PRIVDIS0_PDIS25_Msk               (0x2000000UL)             /*!< PAU PRIVDIS0: PDIS25 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS0_PDIS26_Pos               (26UL)                    /*!< PAU PRIVDIS0: PDIS26 (Bit 26)                               */
#define PAU_PRIVDIS0_PDIS26_Msk               (0x4000000UL)             /*!< PAU PRIVDIS0: PDIS26 (Bitfield-Mask: 0x01)                  */

/* --------------------------------  PAU_PRIVDIS1  -------------------------------- */
#define PAU_PRIVDIS1_PDIS0_Pos                (0UL)                     /*!< PAU PRIVDIS1: PDIS0 (Bit 0)                                 */
#define PAU_PRIVDIS1_PDIS0_Msk                (0x1UL)                   /*!< PAU PRIVDIS1: PDIS0 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS1_PDIS1_Pos                (1UL)                     /*!< PAU PRIVDIS1: PDIS1 (Bit 1)                                 */
#define PAU_PRIVDIS1_PDIS1_Msk                (0x2UL)                   /*!< PAU PRIVDIS1: PDIS1 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS1_PDIS5_Pos                (5UL)                     /*!< PAU PRIVDIS1: PDIS5 (Bit 5)                                 */
#define PAU_PRIVDIS1_PDIS5_Msk                (0x20UL)                  /*!< PAU PRIVDIS1: PDIS5 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS1_PDIS6_Pos                (6UL)                     /*!< PAU PRIVDIS1: PDIS6 (Bit 6)                                 */
#define PAU_PRIVDIS1_PDIS6_Msk                (0x40UL)                  /*!< PAU PRIVDIS1: PDIS6 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS1_PDIS7_Pos                (7UL)                     /*!< PAU PRIVDIS1: PDIS7 (Bit 7)                                 */
#define PAU_PRIVDIS1_PDIS7_Msk                (0x80UL)                  /*!< PAU PRIVDIS1: PDIS7 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS1_PDIS8_Pos                (8UL)                     /*!< PAU PRIVDIS1: PDIS8 (Bit 8)                                 */
#define PAU_PRIVDIS1_PDIS8_Msk                (0x100UL)                 /*!< PAU PRIVDIS1: PDIS8 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS1_PDIS9_Pos                (9UL)                     /*!< PAU PRIVDIS1: PDIS9 (Bit 9)                                 */
#define PAU_PRIVDIS1_PDIS9_Msk                (0x200UL)                 /*!< PAU PRIVDIS1: PDIS9 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS1_PDIS10_Pos               (10UL)                    /*!< PAU PRIVDIS1: PDIS10 (Bit 10)                               */
#define PAU_PRIVDIS1_PDIS10_Msk               (0x400UL)                 /*!< PAU PRIVDIS1: PDIS10 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS1_PDIS11_Pos               (11UL)                    /*!< PAU PRIVDIS1: PDIS11 (Bit 11)                               */
#define PAU_PRIVDIS1_PDIS11_Msk               (0x800UL)                 /*!< PAU PRIVDIS1: PDIS11 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS1_PDIS12_Pos               (12UL)                    /*!< PAU PRIVDIS1: PDIS12 (Bit 12)                               */
#define PAU_PRIVDIS1_PDIS12_Msk               (0x1000UL)                /*!< PAU PRIVDIS1: PDIS12 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS1_PDIS16_Pos               (16UL)                    /*!< PAU PRIVDIS1: PDIS16 (Bit 16)                               */
#define PAU_PRIVDIS1_PDIS16_Msk               (0x10000UL)               /*!< PAU PRIVDIS1: PDIS16 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS1_PDIS17_Pos               (17UL)                    /*!< PAU PRIVDIS1: PDIS17 (Bit 17)                               */
#define PAU_PRIVDIS1_PDIS17_Msk               (0x20000UL)               /*!< PAU PRIVDIS1: PDIS17 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS1_PDIS25_Pos               (25UL)                    /*!< PAU PRIVDIS1: PDIS25 (Bit 25)                               */
#define PAU_PRIVDIS1_PDIS25_Msk               (0x2000000UL)             /*!< PAU PRIVDIS1: PDIS25 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS1_PDIS26_Pos               (26UL)                    /*!< PAU PRIVDIS1: PDIS26 (Bit 26)                               */
#define PAU_PRIVDIS1_PDIS26_Msk               (0x4000000UL)             /*!< PAU PRIVDIS1: PDIS26 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS1_PDIS27_Pos               (27UL)                    /*!< PAU PRIVDIS1: PDIS27 (Bit 27)                               */
#define PAU_PRIVDIS1_PDIS27_Msk               (0x8000000UL)             /*!< PAU PRIVDIS1: PDIS27 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS1_PDIS28_Pos               (28UL)                    /*!< PAU PRIVDIS1: PDIS28 (Bit 28)                               */
#define PAU_PRIVDIS1_PDIS28_Msk               (0x10000000UL)            /*!< PAU PRIVDIS1: PDIS28 (Bitfield-Mask: 0x01)                  */

/* --------------------------------  PAU_PRIVDIS2  -------------------------------- */
#define PAU_PRIVDIS2_PDIS0_Pos                (0UL)                     /*!< PAU PRIVDIS2: PDIS0 (Bit 0)                                 */
#define PAU_PRIVDIS2_PDIS0_Msk                (0x1UL)                   /*!< PAU PRIVDIS2: PDIS0 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS2_PDIS1_Pos                (1UL)                     /*!< PAU PRIVDIS2: PDIS1 (Bit 1)                                 */
#define PAU_PRIVDIS2_PDIS1_Msk                (0x2UL)                   /*!< PAU PRIVDIS2: PDIS1 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS2_PDIS2_Pos                (2UL)                     /*!< PAU PRIVDIS2: PDIS2 (Bit 2)                                 */
#define PAU_PRIVDIS2_PDIS2_Msk                (0x4UL)                   /*!< PAU PRIVDIS2: PDIS2 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS2_PDIS3_Pos                (3UL)                     /*!< PAU PRIVDIS2: PDIS3 (Bit 3)                                 */
#define PAU_PRIVDIS2_PDIS3_Msk                (0x8UL)                   /*!< PAU PRIVDIS2: PDIS3 (Bitfield-Mask: 0x01)                   */
#define PAU_PRIVDIS2_PDIS12_Pos               (12UL)                    /*!< PAU PRIVDIS2: PDIS12 (Bit 12)                               */
#define PAU_PRIVDIS2_PDIS12_Msk               (0x1000UL)                /*!< PAU PRIVDIS2: PDIS12 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS2_PDIS13_Pos               (13UL)                    /*!< PAU PRIVDIS2: PDIS13 (Bit 13)                               */
#define PAU_PRIVDIS2_PDIS13_Msk               (0x2000UL)                /*!< PAU PRIVDIS2: PDIS13 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS2_PDIS14_Pos               (14UL)                    /*!< PAU PRIVDIS2: PDIS14 (Bit 14)                               */
#define PAU_PRIVDIS2_PDIS14_Msk               (0x4000UL)                /*!< PAU PRIVDIS2: PDIS14 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS2_PDIS15_Pos               (15UL)                    /*!< PAU PRIVDIS2: PDIS15 (Bit 15)                               */
#define PAU_PRIVDIS2_PDIS15_Msk               (0x8000UL)                /*!< PAU PRIVDIS2: PDIS15 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS2_PDIS16_Pos               (16UL)                    /*!< PAU PRIVDIS2: PDIS16 (Bit 16)                               */
#define PAU_PRIVDIS2_PDIS16_Msk               (0x10000UL)               /*!< PAU PRIVDIS2: PDIS16 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS2_PDIS17_Pos               (17UL)                    /*!< PAU PRIVDIS2: PDIS17 (Bit 17)                               */
#define PAU_PRIVDIS2_PDIS17_Msk               (0x20000UL)               /*!< PAU PRIVDIS2: PDIS17 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS2_PDIS18_Pos               (18UL)                    /*!< PAU PRIVDIS2: PDIS18 (Bit 18)                               */
#define PAU_PRIVDIS2_PDIS18_Msk               (0x40000UL)               /*!< PAU PRIVDIS2: PDIS18 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS2_PDIS19_Pos               (19UL)                    /*!< PAU PRIVDIS2: PDIS19 (Bit 19)                               */
#define PAU_PRIVDIS2_PDIS19_Msk               (0x80000UL)               /*!< PAU PRIVDIS2: PDIS19 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS2_PDIS20_Pos               (20UL)                    /*!< PAU PRIVDIS2: PDIS20 (Bit 20)                               */
#define PAU_PRIVDIS2_PDIS20_Msk               (0x100000UL)              /*!< PAU PRIVDIS2: PDIS20 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS2_PDIS21_Pos               (21UL)                    /*!< PAU PRIVDIS2: PDIS21 (Bit 21)                               */
#define PAU_PRIVDIS2_PDIS21_Msk               (0x200000UL)              /*!< PAU PRIVDIS2: PDIS21 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS2_PDIS23_Pos               (23UL)                    /*!< PAU PRIVDIS2: PDIS23 (Bit 23)                               */
#define PAU_PRIVDIS2_PDIS23_Msk               (0x800000UL)              /*!< PAU PRIVDIS2: PDIS23 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS2_PDIS28_Pos               (28UL)                    /*!< PAU PRIVDIS2: PDIS28 (Bit 28)                               */
#define PAU_PRIVDIS2_PDIS28_Msk               (0x10000000UL)            /*!< PAU PRIVDIS2: PDIS28 (Bitfield-Mask: 0x01)                  */
#define PAU_PRIVDIS2_PDIS29_Pos               (29UL)                    /*!< PAU PRIVDIS2: PDIS29 (Bit 29)                               */
#define PAU_PRIVDIS2_PDIS29_Msk               (0x20000000UL)            /*!< PAU PRIVDIS2: PDIS29 (Bitfield-Mask: 0x01)                  */

/* ---------------------------------  PAU_ROMSIZE  -------------------------------- */
#define PAU_ROMSIZE_ADDR_Pos                  (8UL)                     /*!< PAU ROMSIZE: ADDR (Bit 8)                                   */
#define PAU_ROMSIZE_ADDR_Msk                  (0x3f00UL)                /*!< PAU ROMSIZE: ADDR (Bitfield-Mask: 0x3f)                     */

/* ---------------------------------  PAU_FLSIZE  --------------------------------- */
#define PAU_FLSIZE_ADDR_Pos                   (12UL)                    /*!< PAU FLSIZE: ADDR (Bit 12)                                   */
#define PAU_FLSIZE_ADDR_Msk                   (0x3f000UL)               /*!< PAU FLSIZE: ADDR (Bitfield-Mask: 0x3f)                      */

/* --------------------------------  PAU_RAM0SIZE  -------------------------------- */
#define PAU_RAM0SIZE_ADDR_Pos                 (8UL)                     /*!< PAU RAM0SIZE: ADDR (Bit 8)                                  */
#define PAU_RAM0SIZE_ADDR_Msk                 (0x1f00UL)                /*!< PAU RAM0SIZE: ADDR (Bitfield-Mask: 0x1f)                    */


/* ================================================================================ */
/* ================          struct 'NVM' Position & Mask          ================ */
/* ================================================================================ */


