Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Infineon/XMC1400_series/Include/XMC1401.h
/* ---------------------------------  PORT2_IOCR4  -------------------------------- */
#define PORT2_IOCR4_PC4_Pos                   (2UL)                     /*!< PORT2 IOCR4: PC4 (Bit 2)                                    */
#define PORT2_IOCR4_PC4_Msk                   (0xfcUL)                  /*!< PORT2 IOCR4: PC4 (Bitfield-Mask: 0x3f)                      */
#define PORT2_IOCR4_PC5_Pos                   (10UL)                    /*!< PORT2 IOCR4: PC5 (Bit 10)                                   */
#define PORT2_IOCR4_PC5_Msk                   (0xfc00UL)                /*!< PORT2 IOCR4: PC5 (Bitfield-Mask: 0x3f)                      */
#define PORT2_IOCR4_PC6_Pos                   (18UL)                    /*!< PORT2 IOCR4: PC6 (Bit 18)                                   */
#define PORT2_IOCR4_PC6_Msk                   (0xfc0000UL)              /*!< PORT2 IOCR4: PC6 (Bitfield-Mask: 0x3f)                      */
#define PORT2_IOCR4_PC7_Pos                   (26UL)                    /*!< PORT2 IOCR4: PC7 (Bit 26)                                   */
#define PORT2_IOCR4_PC7_Msk                   (0xfc000000UL)            /*!< PORT2 IOCR4: PC7 (Bitfield-Mask: 0x3f)                      */

/* ---------------------------------  PORT2_IOCR8  -------------------------------- */
#define PORT2_IOCR8_PC8_Pos                   (2UL)                     /*!< PORT2 IOCR8: PC8 (Bit 2)                                    */
#define PORT2_IOCR8_PC8_Msk                   (0xfcUL)                  /*!< PORT2 IOCR8: PC8 (Bitfield-Mask: 0x3f)                      */
#define PORT2_IOCR8_PC9_Pos                   (10UL)                    /*!< PORT2 IOCR8: PC9 (Bit 10)                                   */
#define PORT2_IOCR8_PC9_Msk                   (0xfc00UL)                /*!< PORT2 IOCR8: PC9 (Bitfield-Mask: 0x3f)                      */
#define PORT2_IOCR8_PC10_Pos                  (18UL)                    /*!< PORT2 IOCR8: PC10 (Bit 18)                                  */
#define PORT2_IOCR8_PC10_Msk                  (0xfc0000UL)              /*!< PORT2 IOCR8: PC10 (Bitfield-Mask: 0x3f)                     */
#define PORT2_IOCR8_PC11_Pos                  (26UL)                    /*!< PORT2 IOCR8: PC11 (Bit 26)                                  */
#define PORT2_IOCR8_PC11_Msk                  (0xfc000000UL)            /*!< PORT2 IOCR8: PC11 (Bitfield-Mask: 0x3f)                     */

/* --------------------------------  PORT2_IOCR12  -------------------------------- */
#define PORT2_IOCR12_PC12_Pos                 (2UL)                     /*!< PORT2 IOCR12: PC12 (Bit 2)                                  */
#define PORT2_IOCR12_PC12_Msk                 (0xfcUL)                  /*!< PORT2 IOCR12: PC12 (Bitfield-Mask: 0x3f)                    */
#define PORT2_IOCR12_PC13_Pos                 (10UL)                    /*!< PORT2 IOCR12: PC13 (Bit 10)                                 */
#define PORT2_IOCR12_PC13_Msk                 (0xfc00UL)                /*!< PORT2 IOCR12: PC13 (Bitfield-Mask: 0x3f)                    */

/* ----------------------------------  PORT2_IN  ---------------------------------- */
#define PORT2_IN_P0_Pos                       (0UL)                     /*!< PORT2 IN: P0 (Bit 0)                                        */
#define PORT2_IN_P0_Msk                       (0x1UL)                   /*!< PORT2 IN: P0 (Bitfield-Mask: 0x01)                          */
#define PORT2_IN_P1_Pos                       (1UL)                     /*!< PORT2 IN: P1 (Bit 1)                                        */
#define PORT2_IN_P1_Msk                       (0x2UL)                   /*!< PORT2 IN: P1 (Bitfield-Mask: 0x01)                          */
#define PORT2_IN_P2_Pos                       (2UL)                     /*!< PORT2 IN: P2 (Bit 2)                                        */
#define PORT2_IN_P2_Msk                       (0x4UL)                   /*!< PORT2 IN: P2 (Bitfield-Mask: 0x01)                          */
#define PORT2_IN_P3_Pos                       (3UL)                     /*!< PORT2 IN: P3 (Bit 3)                                        */
#define PORT2_IN_P3_Msk                       (0x8UL)                   /*!< PORT2 IN: P3 (Bitfield-Mask: 0x01)                          */
#define PORT2_IN_P4_Pos                       (4UL)                     /*!< PORT2 IN: P4 (Bit 4)                                        */
#define PORT2_IN_P4_Msk                       (0x10UL)                  /*!< PORT2 IN: P4 (Bitfield-Mask: 0x01)                          */
#define PORT2_IN_P5_Pos                       (5UL)                     /*!< PORT2 IN: P5 (Bit 5)                                        */
#define PORT2_IN_P5_Msk                       (0x20UL)                  /*!< PORT2 IN: P5 (Bitfield-Mask: 0x01)                          */
#define PORT2_IN_P6_Pos                       (6UL)                     /*!< PORT2 IN: P6 (Bit 6)                                        */
#define PORT2_IN_P6_Msk                       (0x40UL)                  /*!< PORT2 IN: P6 (Bitfield-Mask: 0x01)                          */
#define PORT2_IN_P7_Pos                       (7UL)                     /*!< PORT2 IN: P7 (Bit 7)                                        */
#define PORT2_IN_P7_Msk                       (0x80UL)                  /*!< PORT2 IN: P7 (Bitfield-Mask: 0x01)                          */
#define PORT2_IN_P8_Pos                       (8UL)                     /*!< PORT2 IN: P8 (Bit 8)                                        */
#define PORT2_IN_P8_Msk                       (0x100UL)                 /*!< PORT2 IN: P8 (Bitfield-Mask: 0x01)                          */
#define PORT2_IN_P9_Pos                       (9UL)                     /*!< PORT2 IN: P9 (Bit 9)                                        */
#define PORT2_IN_P9_Msk                       (0x200UL)                 /*!< PORT2 IN: P9 (Bitfield-Mask: 0x01)                          */
#define PORT2_IN_P10_Pos                      (10UL)                    /*!< PORT2 IN: P10 (Bit 10)                                      */
#define PORT2_IN_P10_Msk                      (0x400UL)                 /*!< PORT2 IN: P10 (Bitfield-Mask: 0x01)                         */
#define PORT2_IN_P11_Pos                      (11UL)                    /*!< PORT2 IN: P11 (Bit 11)                                      */
#define PORT2_IN_P11_Msk                      (0x800UL)                 /*!< PORT2 IN: P11 (Bitfield-Mask: 0x01)                         */
#define PORT2_IN_P12_Pos                      (12UL)                    /*!< PORT2 IN: P12 (Bit 12)                                      */
#define PORT2_IN_P12_Msk                      (0x1000UL)                /*!< PORT2 IN: P12 (Bitfield-Mask: 0x01)                         */
#define PORT2_IN_P13_Pos                      (13UL)                    /*!< PORT2 IN: P13 (Bit 13)                                      */
#define PORT2_IN_P13_Msk                      (0x2000UL)                /*!< PORT2 IN: P13 (Bitfield-Mask: 0x01)                         */

